Revit 2027 API
BuiltInFailures.ImportFailures.WorksetCreatedForLinkWarning Property
 Newly created link types and instances were placed in new workset [workset name]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WorksetCreatedForLinkWarning { get; }
Public Shared ReadOnly Property WorksetCreatedForLinkWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WorksetCreatedForLinkWarning {
	FailureDefinitionId^ get ();
}
static member WorksetCreatedForLinkWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace